video-rich-hikey-are-we-there-yet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Video - Rich Hikey - Are we there yet ?</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-12-16 00:28:53 CET"/>
<meta name="author" content="Antoine Romain Dumont"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Video - Rich Hikey - Are we there yet ?</h1>

<p>Completely mind blowing video from Rich Hikey (<a href="http://clojure.org/">Clojure</a>'s creator) where he exposes the limitations of the overall most popular actual languages.
</p>
<p>
Here's the link. I do not enter much in the details here as Rich Hikey himself is so good at explaining.
</p>
<p>
It's not about <a href="http://clojure.org/">Clojure</a>, which is the mere implementation of what this video is all about.
</p>
<p>
Be open-minded, sit back and enjoy!
</p>
<p>
<a href="http://www.infoq.com/presentations/Are-We-There-Yet-Rich-Hickey">Are we there yet?</a>
</p></div>

<div id="postamble">
<p class="date">Date: 2011-12-16 00:28:53 CET</p>
<p class="author">Author: Antoine Romain Dumont</p>
<p class="creator">Org version 7.7 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
